# 파도반 수열

# 오른쪽 그림과 같이 삼각형이 나선 모양으로 놓여져 있다. 첫 삼각형은 정삼각형으로 변의 길이는 1이다.
# 그 다음에는 다음과 같은 과정으로 정삼각형을 계속 추가한다. 나선에서 가장 긴 변의 길이를 k라 했을 때,
# 그 변에 길이가 k인 정삼각형을 추가한다.
# 파도반 수열 P(N)은 나선에 있는 정삼각형의 변의 길이이다. P(1)부터 P(10)까지 첫 10개 숫자는
# 1, 1, 1, 2, 2, 3, 4, 5, 7, 9이다.
# N이 주어졌을 때, P(N)을 구하는 프로그램을 작성하시오.

# 첫째 줄에 테스트 케이스의 개수 T가 주어진다. 각 테스트 케이스는 한 줄로 이루어져 있고, N이 주어진다. (1 ≤ N ≤ 100)
import sys

T = int(sys.stdin.readline())           # case 수
p1 = 1                                  # 1번째 삼각형
p2 = 1                                  # 2번째 삼각형
p3 = 1                                  # 3번째 삼각형
P = [1, 1, 1] + [0] * 98
for i in range(3, 101):
    P[i] = P[i-3] + P[i-2]
for tc in range(T):                     # case 반복
    p = int(sys.stdin.readline())       # P 입력
    print(P[p-1])