# 완전수

# 어떠한 자연수 N에 대해서 N을 제외한 약수(진약수)의 합이 N이 되는 자연수를 완전수라고 한다.
# 예를 들어, 6의 약수는 1, 2, 3, 6인데 1+2+3은 6이기 때문에 완전수이다. 또 진약수의 합이 자기
# 자신보다 작은 경우를 부족수, 진약수의 합이 자기 자신보다 큰 경우를 과잉수라고 한다.
# 이때, 어떤 수가 주어질 때 이 수가 완전수인지, 부족수인지, 과잉수인지를 구하는 프로그램을 작성하시오.

# 첫째 줄에 자연수의 개수 T가 주어진다. T은 1000보다 작은 수이다.
# 둘째 줄에는 공백을 사이에 두고 완전수인지 구해야 되는 자연수 N이 주어진다.(N<10000)

T = int(input())                       # 자연수의 개수
num = list(map(int, input().split()))  # list 에 넣기

for i in num:                          # 리스트를 반복
    measure = 0                        # 약수의 합
    for j in range(1, i):              # 0넣으면 에러나니깐 1부터
        if i % j == 0:                 # 나머지가 0이면 약수이니깐
            measure += j               # 약수의 합에 추가
    else:                              # for 문을 다돌면
        if measure == i:               # 약수와 같으면 완전수
            print('Perfect')
        elif measure < i:              # 작으면 부족수
            print('Deficient')
        elif measure > i:              # 크면 과잉수
            print('Abundant')


