# 방 번호

# 다솜이는 은진이의 옆집에 새로 이사왔다. 다솜이는 자기 방 번호를 예쁜 플라스틱 숫자로 문에 붙이려고 한다.
# 다솜이의 옆집에서는 플라스틱 숫자를 한 세트로 판다. 한 세트에는 0번부터 9번까지 숫자가 하나씩 들어있다.
# 다솜이의 방 번호가 주어졌을 때, 필요한 세트의 개수의 최솟값을 출력하시오.
# (6은 9를 뒤집어서 이용할 수 있고, 9는 6을 뒤집어서 이용할 수 있다.)

# 첫째 줄에 다솜이의 방 번호 N이 주어진다. N은 1,000,000보다 작거나 같은 자연수 또는 0이다.

N = int(input())
count = [0] * 10                            # 카운팅
ans = 0
for i in range(len(str(N))):                # num 의 길이만큼 반복
    count[N % 10] += 1                      # 10으로 나눈 나머지를 추가
    N = N // 10                             # 10을 나눈 값으로 초기화
if (count[6] + count[9]) % 2:               # 6 9 의 수의합이 홀수면
    count[6] = (count[6] + count[9])//2 + 1 # 6을 2로나눠서 1더해주고
    count[9] = 0                            # 9는 0으로 초기화 
else:                                       # 짝수면
    count[6] = (count[6] + count[9]) // 2   # 6을 2로 나눈값
    count[9] = 0                            # 9는 0으로 초기화

ans = max(count)                            # 최댓값 count의 합
print(ans)

