# 1,2,3 더하기

# 정수 4를 1, 2, 3의 합으로 나타내는 방법은 총 7가지가 있다. 합을 나타낼 때는 수를 1개 이상 사용해야 한다.
# 1+1+1+1
# 1+1+2
# 1+2+1
# 2+1+1
# 2+2
# 1+3
# 3+1
# 정수 n이 주어졌을 때, n을 1, 2, 3의 합으로 나타내는 방법의 수를 구하는 프로그램을 작성하시오.

# 첫째 줄에 테스트 케이스의 개수 T가 주어진다. 각 테스트 케이스는
# 한 줄로 이루어져 있고, 정수 n이 주어진다. n은 양수이며 11보다 작다.


def hap(n):                                    # 함수 설정
    if n == 1:                                 # 1일때는 n1
        return n1                              
    elif n == 2:                               # 2일때는 n2
        return n2
    elif n == 3:                               # 3일때는 n3
        return n3
    else:                                      # 그이상은 앞의 3개의 합
        return hap(n-3) + hap(n-2) + hap(n-1)


T = int(input())                                # 입력
n1 = 1                                          # 1
n2 = 2                                          # 2
n3 = 4                                          # 3
for tc in range(T):                             # case 반복
    n = int(input())                            # 입력
    print(hap(n))                               # 출력

