# 딱지놀이

# 두 어린이 A, B가 딱지놀이를 한다. 딱지놀이 규칙은 다음과 같다. 두 어린이는 처음에 여러 장의 딱지를 가지고 있고,
# 매 라운드마다 각자 자신이 가진 딱지 중 하나를 낸다. 딱지에는 별(★), 동그라미(●), 네모(■), 세모(▲),
# 네 가지 모양 중 하나 이상의 모양이 표시되어 있다. 두 어린이가 낸 딱지 중 어느 쪽이 더 강력한 것인지는 다음 규칙을 따른다.
# 만약 두 딱지의 별의 개수가 다르다면, 별이 많은 쪽의 딱지가 이긴다.
# 별의 개수가 같고 동그라미의 개수가 다르다면, 동그라미가 많은 쪽의 딱지가 이긴다.
# 별, 동그라미의 개수가 각각 같고 네모의 개수가 다르다면, 네모가 많은 쪽의 딱지가 이긴다.
# 별, 동그라미, 네모의 개수가 각각 같고 세모의 개수가 다르다면, 세모가 많은 쪽의 딱지가 이긴다.
# 별, 동그라미, 네모, 세모의 개수가 각각 모두 같다면 무승부이다.
# 라운드의 수 N과 두 어린이가 순서대로 내는 딱지의 정보가 주어졌을 때,
# 각 라운드별로 딱지놀이의 결과를 구하는 프로그램을 작성하시오.

# 표준 입력으로 다음 정보가 주어진다. 첫 번째 줄에는 딱지놀이의 총 라운드 수를 나타내는 자연수 N이 주어진다.
# N 은 1 이상 1,000 이하이다. 다음 줄에는 라운드 1에서 어린이 A가 내는 딱지에 나온 그림의 총 개수 a가 주어진다.
# a는 1 이상 100 이하이다. 뒤따라 나오는 a개의 정수는 어린이 A가 낸 딱지의 그림을 나타내는데,
# 각각 4, 3, 2, 1 중 하나의 값이다. 4, 3, 2, 1의 순서대로 주어지지 않을 수 있음에 주의하라.
# 다음 줄에는 라운드 1에서 어린이 B가 내는 딱지에 나온 그림의 총 개수 b가 주어진다. b도 1 이상 100 이하이다.
# 뒤따라 나오는 b개의 정수는 어린이 B가 낸 딱지의 그림을 나타내는데, 역시 4, 3, 2, 1 중 하나의 값이다.
# 역시 4, 3, 2, 1의 순서대로 주어지지 않을 수 있음에 주의하라. 다음 두 줄에는 라운드 2에서 어린이 A, B가
# 낸 딱지의 그림들을 같은 식으로 표현한다. 위와 같은 식으로 매 라운드마다 두 어린이가 낸 딱지의 정보는 두 줄에 표현되며,
# N 라운드의 딱지 정보는 차례대로 총 2N 개의 줄에 주어진다.

N = int(input())                          # 라운드 개수

for i in range(N):                        # 라운드 반복
    A = list(map(int, input().split()))   # 그림의 개수와 그림 모양
    A.pop(0)                              # 그림의 개수 삭제
    B = list(map(int, input().split()))   # 그림의 개수와 그림 모양
    B.pop(0)                              # 그림의 개수 삭제
    cnt_A = [0, 0, 0, 0]                  # A 문양의 개수 파악용
    cnt_B = [0, 0, 0, 0]                  # B 문양의 개수 파악용
    for j in A:                           # 카운트
        cnt_A[j-1] += 1 
    for j in B:                           # 카운트
        cnt_B[j-1] += 1

    for k in range(3, -1, -1):            # 큰게 많을 수록 이기니깐 뒤에서 부터 반복
        if cnt_A[k] > cnt_B[k]:           # A가 이길경우
            print('A')
            break
        elif cnt_A[k] < cnt_B[k]:         # B가 이길경우
            print('B')
            break
    else:                                 # 비길 경우
        print('D')
