# 서로 다른 N개의 자연수의 합이 S라고 한다. S를 알 때, 자연수 N의 최댓값은 얼마일까?

# 첫째 줄에 자연수 S(1 ≤ S ≤ 4,294,967,295)가 주어진다.
S = int(input())            # 자연수 입력
N = 0                       # 갯수
hap = 0                     # 총합
for i in range(1, S+1):     # 1부터 더해서 가는데 S+1 까지라고해야 오류가 안남...
    hap += i                # 총합에 더해준다 1 + 2 + 3 + 4 ...20
    if hap == S:            # 합이랑 같다면
        N = i               # i 출력
        break               # 멈춰
    if hap > S:             # 넘어간다면
        N = i - 1           # 1을 빼준다
        break               # 멈춰
print(N)
