# N번째 큰 수

# 배열 A가 주어졌을 때, N번째 큰 값을 출력하는 프로그램을 작성하시오.
# 배열 A의 크기는 항상 10이고, 자연수만 가지고 있다. N은 항상 3이다.

# 첫째 줄에 테스트 케이스의 개수 T(1 <= T <= 1,000)가 주어진다. 각 테스트 케이스는 한 줄로 이루어져 있고,
# 배열 A의 원소 10개가 공백으로 구분되어 주어진다. 이 원소는 1보다 크거나 같고, 1,000보다 작거나 같은 자연수이다.

T = int(input())                                 # case 수
for tc in range(T):                              # case 만큼 반복
    A = list(map(int, input().split()))          # A 배열
    for i in range(9, 0, -1):                    # 뒤에서 부터
        for j in range(0, i):                    #
            if A[j] > A[j + 1]:                  # 두수를 비교하여
                A[j], A[j + 1] = A[j + 1], A[j]  # 정렬한다

    print(A[-3])                                 # 3번째로 큰수